---
kind: type
id: T:Autodesk.Revit.DB.Lighting.SpotLightDistribution
source: html/aaf39909-187f-cc63-fd13-a0d607c382d2.htm
---
# Autodesk.Revit.DB.Lighting.SpotLightDistribution

This class encapsulates a spot light distribution.

## Syntax (C#)
```csharp
public class SpotLightDistribution : LightDistribution
```